# Даны два числа. Вывести большее из них.
p = int(input('Введите первое число: '))
k = int(input('Введите второе число: '))

if p > k:
    print('Результат: ', p)
else:
    print('Результат: ', k)
