# Дано множество A из N точек (точки заданы своими координатами х, у). Среди всех
# точек этого множества, лежащих во второй четверти, найти точку, наиболее удаленную
# от начала координат. Если таких точек нет, то вывести точку с нулевыми
# координатами.
# Расстояние R между точками с координатами (x1, y1) и (x2, у2) вычисляется по формуле:
# R = √(x2 – x1)2 + (у2 – y1)2
# .
# Для хранения данных о каждом наборе точек следует использовать по два списка: первый
# список для хранения абсцисс, второй — для хранения ординат.


